package org.HW_280923.hw_3;

public class Main {
    public static void main(String[] args) {
//        Создайте класс для хранения пары строк (Pair). В классе создайте приватные поля first и second.
//        Создайте геттеры для этих полей. Создайте блок инициализации, в котором выведите в консоль значение полей first и second,
//        а затем присвойте полю first значение “one”, а полю second значение «two».
//        Создайте конструктор по умолчанию (без входных параметров).
//        Внутри конструктора выведите в консоль значение полей first и second.
//        Создайте конструктор, который принимает параметры first и second и обновляет значения соответствующих полей.
//        Внутри конструктора выведите в консоль значение полей first и second.
//        В программе создайте объект Pair двумя разными конструкторами.

        Pair pair1 = new Pair();
        Pair pair2 = new Pair("eins", "zwei");
    }
}
